alplabai/alp-sdk/examples/v2n/v2n-gd32-bridge-hil-soak/src/main.c
/*
 * Copyright 2026 Alp Lab AB
 * SPDX-License-Identifier: Apache-2.0
 *
 * v2n-gd32-bridge-hil-soak — pass/fail soak of the WHOLE GD32 bridge
 * command set over the 25 MHz SPI fast path.
 *
 * Where v2n-gd32-bridge-ping proves the link (PING + GET_VERSION),
 * this example proves the COMMAND SET: every opcode the bridge
 * firmware implements is exercised each cycle with a self-contained
 * verification (readback compare, range sanity, monotonicity, or a
 * documented-sentinel assert) — no external instruments needed.
 * Scope tests (PWM waveform shape, ADC absolute accuracy) stay in
 * the HIL-PLAN instrument rows; this soak is the "does every opcode
 * round-trip and tell the truth" layer underneath them.
 *
 * The mix deliberately stresses the 25 MHz framing: PING is a 4-byte
 * (even) reply, GET_VERSION 7 bytes (odd), ADC_STREAM_READ up to
 * 1 + 2*N bytes — so both parities and long frames hit the GD32's
 * DMA reply path every cycle (the odd-length FIFO-residue failure
 * class is what the byte-access reply fix addressed).
 *
 * Pass/fail accounting: each test bumps a per-test pass or fail
 * counter and the soak NEVER halts on failure — a soak's job is to
 * count, recover, and keep hammering.  A cycle summary prints every
 * cycle and a cumulative table every 16 cycles; any FAIL line carries
 * the alp_status_t so a console log alone is diagnosable.
 */

#include <stdio.h>
#include <string.h>

#include <zephyr/kernel.h>

#include "alp/peripheral.h"
#include "alp/chips/gd32g553.h"

/* ------------------------------------------------------------------ */
/* Soak bookkeeping                                                    */
/* ------------------------------------------------------------------ */

typedef struct {
	const char *name;
	uint32_t    pass;
	uint32_t    fail;
	int         last_status; /* last failing alp_status_t (0 if none) */
} soak_stat_t;

/* One context for the whole soak; opened once, recovered on demand. */
static gd32g553_t ctx;

/* Version captured at init -- GET_VERSION must keep matching it
 * (a mid-soak change would mean the GD32 silently rebooted). */
static gd32g553_version_t boot_version;

/* Build-id captured on the first successful read -- must stay
 * constant for the same reason. */
static char boot_build_id[GD32G553_BUILD_ID_LEN + 1];
static bool boot_build_id_valid;

/* FAIL printf helper: one line per failure, with the status code,
 * so a UART capture alone localises the broken opcode. */
#define SOAK_FAIL(st, fmt, ...) printf("[hil-soak] FAIL %s: " fmt "\n", st->name, ##__VA_ARGS__)

static bool float_near(float a, float b, float tol)
{
	const float d = (a > b) ? (a - b) : (b - a);
	return d <= tol;
}

/* ------------------------------------------------------------------ */
/* Per-opcode tests.  Each returns true on pass and logs on failure.   */
/* ------------------------------------------------------------------ */

/* 0x00 PING -- 4-byte (even-parity) reply envelope. */
static bool t_ping(soak_stat_t *st)
{
	const alp_status_t s = gd32g553_ping_via(&ctx, GD32G553_TRANSPORT_SPI);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	return true;
}

/* 0x01 GET_VERSION -- 7-byte (odd-parity) reply; must match the
 * version read at init (a change = the GD32 rebooted mid-soak). */
static bool t_get_version(soak_stat_t *st)
{
	gd32g553_version_t v = { 0 };
	const alp_status_t s = gd32g553_get_version(&ctx, &v);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	if (v.major != boot_version.major || v.minor != boot_version.minor ||
	    v.patch != boot_version.patch) {
		SOAK_FAIL(st,
		          "version changed mid-soak: v%u.%u.%u (boot v%u.%u.%u)",
		          v.major,
		          v.minor,
		          v.patch,
		          boot_version.major,
		          boot_version.minor,
		          boot_version.patch);
		return false;
	}
	return true;
}

/* 0x02 GET_BUILD_ID -- non-empty, NUL-terminated, constant. */
static bool t_get_build_id(soak_stat_t *st)
{
	char               id[GD32G553_BUILD_ID_LEN + 1] = { 0 };
	const alp_status_t s                             = gd32g553_get_build_id(&ctx, id);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	if (id[0] == '\0') {
		SOAK_FAIL(st, "empty build-id");
		return false;
	}
	if (!boot_build_id_valid) {
		memcpy(boot_build_id, id, sizeof boot_build_id);
		boot_build_id_valid = true;
		printf("[hil-soak] firmware build-id: %s\n", id);
	} else if (strncmp(id, boot_build_id, GD32G553_BUILD_ID_LEN) != 0) {
		SOAK_FAIL(st, "build-id changed mid-soak: %s (boot %s)", id, boot_build_id);
		return false;
	}
	return true;
}

/* 0x03 RESET_REASON -- any in-range cause passes; logged once so a
 * cold-boot run shows POWER_ON and a watchdog event shows WDT. */
static bool t_reset_reason(soak_stat_t *st)
{
	gd32g553_reset_cause_t cause;
	const alp_status_t     s = gd32g553_get_reset_reason(&ctx, &cause);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	if (cause > GD32G553_RESET_LOWPOWER) {
		SOAK_FAIL(st, "out-of-range cause %d", (int)cause);
		return false;
	}
	return true;
}

/* 0x10/0x11 GPIO_READ + GPIO_WRITE.  mask=0 makes the write a
 * provable no-op (atomically changes nothing) while still pushing the
 * full request/decode/dispatch path through the wire -- the soak must
 * not flip real supervisor pads (camera LDOs, REG_ONs, SE_RST live
 * on this map). */
static bool t_gpio(soak_stat_t *st)
{
	uint32_t     levels = 0;
	alp_status_t s      = gd32g553_gpio_read(&ctx, 0xFFFFFFFFu, &levels);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "read status=%d", (int)s);
		return false;
	}
	s = gd32g553_gpio_write(&ctx, 0u, 0u);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "write status=%d", (int)s);
		return false;
	}
	return true;
}

/* 0x20/0x21 PWM_SET + PWM_GET readback.  1 kHz / 25 % on PWM0
 * (TIMER0_MCH0, GD32 pad PA11 -> an unloaded E1M edge pin on the
 * bench).  The firmware rounds to its ~4.63 ns tick, so the readback
 * compare allows 1 % -- far above rounding, far below a real bug.
 * Duty returns to 0 afterwards so the pad idles low between cycles. */
static bool t_pwm_set_get(soak_stat_t *st)
{
	const uint32_t period = 1000000u; /* 1 ms */
	const uint32_t duty   = 250000u;  /* 25 % */
	uint32_t       rp = 0, rd = 0;
	alp_status_t   s = gd32g553_pwm_set(&ctx, 0u, period, duty);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "set status=%d", (int)s);
		return false;
	}
	s = gd32g553_pwm_get(&ctx, 0u, &rp, &rd);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "get status=%d", (int)s);
		return false;
	}
	const bool ok = (rp > period - period / 100u) && (rp < period + period / 100u) &&
	                (rd > duty - duty / 100u) && (rd < duty + duty / 100u);
	if (!ok) {
		SOAK_FAIL(st, "readback %u/%u ns (wrote %u/%u)", rp, rd, period, duty);
	}
	(void)gd32g553_pwm_set(&ctx, 0u, period, 0u); /* park the pad low */
	return ok;
}

/* 0x26 PWM_SINGLE_PULSE -- one 1 us one-shot on PWM1.  Status-only
 * here; the pulse itself is a scope row in the HIL-PLAN. */
static bool t_pwm_single_pulse(soak_stat_t *st)
{
	const alp_status_t s = gd32g553_pwm_single_pulse(&ctx, 1u, 1000u);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	return true;
}

/* 0x23/0x24/0x25 PWM capture begin/read/end on PWM2.  Nothing drives
 * the pad on the bench, so READ legitimately reports "no edges yet"
 * -- the firmware maps an empty capture ring to NOSUPPORT today (the
 * input pad routing is a known follow-up), so OK and NOSUPPORT both
 * pass; any other status (or a failing begin/end) is a real fault. */
static bool t_pwm_capture(soak_stat_t *st)
{
	alp_status_t s = gd32g553_pwm_capture_begin(&ctx, 2u, 2u /* both edges */);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "begin status=%d", (int)s);
		return false;
	}
	uint32_t period = 0, pulse = 0;
	s = gd32g553_pwm_capture_read(&ctx, 2u, &period, &pulse);
	if (s != ALP_OK && s != ALP_ERR_NOSUPPORT) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "read status=%d", (int)s);
		(void)gd32g553_pwm_capture_end(&ctx, 2u);
		return false;
	}
	s = gd32g553_pwm_capture_end(&ctx, 2u);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "end status=%d", (int)s);
		return false;
	}
	return true;
}

/* 0x30 ADC_READ -- 4 firmware-averaged samples off E1M ADC0.  The
 * pad floats on the bench so any value is "right"; the assert is the
 * physical ceiling (VREF 3.3 V) plus a successful 4-sample reply. */
static bool t_adc_read(soak_stat_t *st)
{
	uint16_t           mv[4] = { 0 };
	const alp_status_t s     = gd32g553_adc_read(&ctx, 0u, 4u, mv);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	for (unsigned i = 0; i < 4u; ++i) {
		if (mv[i] > 3400u) {
			SOAK_FAIL(st, "sample %u = %u mV > VREF", i, mv[i]);
			return false;
		}
	}
	return true;
}

/* 0x33/0x34/0x35 ADC stream -- THE regression test for the stream
 * data path (v0.2.4 root causes: CTL1.DDM never set so the ADC
 * stopped issuing DMA requests after one run; CTL1 programmed on a
 * running converter; pacing timer absent so `sample_rate_hz` was
 * silently ignored).  Two reads make the assertion HONEST:
 *
 *   read 1 after 50 ms @ 1 kHz: ~50 samples accumulated, so a
 *     paced stream MUST return exactly the 32-sample cap.
 *   read 2 immediately after: only the ~18 paced leftovers (plus a
 *     few ms of sleep-overshoot + link latency) remain.  A
 *     free-running stream that ignores the rate would have lapped
 *     the ring and answer 32 again; a dead stream answers 0.
 *     1..30 proves the pacing timer is real.                    */
static bool t_adc_stream(soak_stat_t *st)
{
	alp_status_t s = gd32g553_adc_stream_begin(&ctx, 0u, 0u, 1000u);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "begin status=%d", (int)s);
		return false;
	}

	k_msleep(50); /* ~50 samples into the 1024-deep ring at 1 kHz */

	uint8_t  got            = 0;
	uint8_t  got2           = 0;
	uint16_t mv[32]         = { 0 };
	s                       = gd32g553_adc_stream_read(&ctx, 0u, 32u, &got, mv);
	const alp_status_t s_r2 = gd32g553_adc_stream_read(&ctx, 0u, 32u, &got2, mv);

	const alp_status_t s_end = gd32g553_adc_stream_end(&ctx, 0u);

	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "read status=%d", (int)s);
		return false;
	}
	if (got != 32u) {
		SOAK_FAIL(
		    st, "read1 got=%u (want 32: ~50 paced samples after 50 ms @1 kHz)", (unsigned)got);
		return false;
	}
	if (s_r2 != ALP_OK) {
		st->last_status = (int)s_r2;
		SOAK_FAIL(st, "read2 status=%d", (int)s_r2);
		return false;
	}
	if (got2 == 0u || got2 > 30u) {
		SOAK_FAIL(st,
		          "read2 got=%u (want 1..30: paced leftovers; 32 = rate ignored/free-run)",
		          (unsigned)got2);
		return false;
	}
	if (s_end != ALP_OK) {
		st->last_status = (int)s_end;
		SOAK_FAIL(st, "end status=%d", (int)s_end);
		return false;
	}
	return true;
}

/* fw v0.2.8 converter-ownership guard -- the targeted probe for the
 * delta-review fix: while a stream owns an ADC converter, a single-
 * shot ADC_READ on EITHER logical channel of that converter must be
 * REFUSED (ALP_ERR_IO on the wire) instead of silently re-pointing
 * routine rank 0 out from under the stream's DMA; a read on a
 * DIFFERENT converter must keep working; and the refusal must not be
 * sticky after STREAM_END.  Channel pairs per converter: ch0/1 ->
 * ADC3, ch2/3 -> ADC2, ch4/5 -> ADC1, ch6/7 -> ADC0.
 *
 * Pre-v0.2.8 firmware answers the sibling read with STATUS_OK
 * (serving corrupted data and often killing the stream config), so
 * this row DOUBLES as a version probe: it fails loudly on old
 * firmware. */
static bool t_adc_stream_guard(soak_stat_t *st)
{
	alp_status_t s = gd32g553_adc_stream_begin(&ctx, 0u, 0u, 1000u);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "begin status=%d", (int)s);
		return false;
	}

	uint16_t           mv[2]   = { 0 };
	const alp_status_t s_sib   = gd32g553_adc_read(&ctx, 1u, 1u, mv); /* ADC3 sibling   */
	const alp_status_t s_other = gd32g553_adc_read(&ctx, 4u, 1u, mv); /* ADC1: distinct */
	const alp_status_t s_end   = gd32g553_adc_stream_end(&ctx, 0u);
	const alp_status_t s_after = gd32g553_adc_read(&ctx, 1u, 1u, mv); /* unstuck?       */

	if (s_sib != ALP_ERR_IO) {
		st->last_status = (int)s_sib;
		SOAK_FAIL(st,
		          "sibling read during stream answered %d (want ALP_ERR_IO: converter owned)",
		          (int)s_sib);
		return false;
	}
	if (s_other != ALP_OK) {
		st->last_status = (int)s_other;
		SOAK_FAIL(st, "other-converter read status=%d (guard over-blocks)", (int)s_other);
		return false;
	}
	if (s_end != ALP_OK) {
		st->last_status = (int)s_end;
		SOAK_FAIL(st, "end status=%d", (int)s_end);
		return false;
	}
	if (s_after != ALP_OK) {
		st->last_status = (int)s_after;
		SOAK_FAIL(st, "post-end sibling read status=%d (guard stuck)", (int)s_after);
		return false;
	}
	return true;
}

/* 0x50/0x51 DAC_SET + DAC_GET readback.  12-bit DAC off the 1.8 V
 * analog rail is ~0.44 mV/LSB; ±16 mV of tolerance covers rounding
 * plus a generous firmware-side conversion slack.  Returns the pad
 * to 0 mV so the bench pin idles between cycles.
 *
 * SETPOINT BOUNDED at 600 mV: a safe mid-low point on the 1.8 V
 * analog rail.  This row stays defensive about the X-EVK Tier-B
 * bench, where DAC0 is jumpered straight to the ADC0 pad (CK_ANA) --
 * keeping the command well under the 1.8 V rail means the soak can
 * run with that jumper installed without driving the ADC pad to its
 * ceiling.  With the v0.2.6 VREF fix (internal reference now live)
 * this readback finally measures the real pad, not a dead converter. */
static bool t_dac(soak_stat_t *st)
{
	uint16_t     rb = 0;
	alp_status_t s  = gd32g553_dac_set(&ctx, 0u, 600u);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "set status=%d", (int)s);
		return false;
	}
	s = gd32g553_dac_get(&ctx, 0u, &rb);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "get status=%d", (int)s);
		return false;
	}
	const bool ok = (rb >= 600u - 16u) && (rb <= 600u + 16u);
	if (!ok) {
		SOAK_FAIL(st, "readback %u mV (wrote 600)", rb);
	}
	(void)gd32g553_dac_set(&ctx, 0u, 0u);
	return ok;
}

/* 0x60/0x61 QENC reset + read.  No encoder turns on the bench, so a
 * freshly-reset count must read back exactly 0. */
static bool t_qenc(soak_stat_t *st)
{
	alp_status_t s = gd32g553_qenc_reset(&ctx, 0u);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "reset status=%d", (int)s);
		return false;
	}
	int32_t pos = -1;
	s           = gd32g553_qenc_read(&ctx, 0u, &pos);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "read status=%d", (int)s);
		return false;
	}
	/* No encoder is attached on the bench, so the A/B inputs FLOAT
     * and the X4 decoder free-runs on noise -- the observed drift
     * between RESET and READ exceeds any "small" bound (a +/-8 window
     * still failed every cycle).  With a floating input the position
     * VALUE is physically meaningless, so this row asserts only the
     * opcode round-trips (reset accepted, read returns a count);
     * value-correct position tracking belongs to the functional tier
     * with a real stimulus (PWM-driven A/B loopback jumpers). */
	(void)pos;
	return true;
}

/* 0x70 COUNTER_READ -- the GD32's DWT cycle counter; two reads a few
 * hundred microseconds apart must be strictly increasing (modulo a
 * 32-bit wrap, which at 216 MHz comes every ~19.9 s -- one spurious
 * fail per wrap window is acceptable soak noise and shows up as a
 * lone count, not a streak).
 *
 * STALE-REPLY DISCRIMINATOR (2026-06-06): two back-to-back IDENTICAL
 * minimal frames are also the perfect victim for the transport's
 * documented residual hazard (transport_spi.c: a request lost whole
 * in the reset window re-serves the PREVIOUS CRC-valid reply, which
 * for a same-opcode re-read masquerades as fresh) -- and this row is
 * the soak's only consecutive-reply INEQUALITY assertion, so it is
 * the only row that can even SEE that hazard.  To tell a stale reply
 * from a genuinely-stuck counter, the asserted pair now interposes a
 * GET_VERSION between the two counter reads (a stale counter reply
 * cannot masquerade as a version reply: wrong shape, host rejects),
 * while the ORIGINAL raw back-to-back pair is kept as pure telemetry:
 * counter_forensics[] counts how often the raw pair reads equal.
 * Raw-pair equality with the interposed pair healthy = the transport
 * hazard fingerprint (the sequence-echo design kills it for real). */
static volatile uint32_t counter_forensics[4]; /* [0]=last raw a, [1]=last raw b,
                                                  [2]=raw-equal count, [3]=raw pairs */

/* v0.7 link telemetry, refreshed once per soak cycle for the SWD
 * reader: [0] = STATUS_SEQ negotiated this session, [1] = stale
 * replies the host driver caught + recovered (each one is the
 * residual hazard FIRING and being killed -- the raw counter pair
 * above should read equal in lockstep whenever [1] advances). */
static volatile uint32_t seq_forensics[2];
static bool              t_counter(soak_stat_t *st)
{
	uint32_t     a = 0, raw_b = 0, b = 0;
	alp_status_t s = gd32g553_counter_read(&ctx, 0u, &a);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	k_busy_wait(200);

	/* Telemetry pair: the original back-to-back same-opcode read. */
	s = gd32g553_counter_read(&ctx, 0u, &raw_b);
	if (s == ALP_OK) {
		counter_forensics[0] = a;
		counter_forensics[1] = raw_b;
		counter_forensics[3]++;
		if (raw_b == a) {
			counter_forensics[2]++;
		}
	}

	/* Interposed different-opcode request: breaks any same-opcode
     * stale-reply masquerade before the asserted second read. */
	{
		gd32g553_version_t v = { 0 };
		(void)gd32g553_get_version(&ctx, &v);
	}

	s = gd32g553_counter_read(&ctx, 0u, &b);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	if (b == a) {
		SOAK_FAIL(st, "counter frozen at %u", a);
		return false;
	}
	return true;
}

/* 0x80 TRNG_READ -- two 16-byte pulls: each must be non-constant and
 * the two must differ.  (A statistical health test is the silicon
 * TRNG's own SP800-90B logic; the soak just proves entropy flows.)
 *
 * One retry per pull: this silicon's TRNG takes INTERMITTENT seed
 * errors; the firmware detects the latched fault, fails that one
 * call fast and rebuilds the unit on the next (silicon-validated
 * 2026-06-04).  A single fault-recover cycle landing mid-test is the
 * documented contract, not a defect -- two failures in a row is. */
static bool t_trng(soak_stat_t *st)
{
	uint8_t      a[16] = { 0 }, b[16] = { 0 };
	alp_status_t s = gd32g553_trng_read(&ctx, a, sizeof a);
	if (s != ALP_OK) {
		s = gd32g553_trng_read(&ctx, a, sizeof a); /* post-rebuild retry */
	}
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	s = gd32g553_trng_read(&ctx, b, sizeof b);
	if (s != ALP_OK) {
		s = gd32g553_trng_read(&ctx, b, sizeof b); /* post-rebuild retry */
	}
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	bool constant = true;
	for (unsigned i = 1; i < sizeof a; ++i) {
		if (a[i] != a[0]) {
			constant = false;
			break;
		}
	}
	if (constant) {
		SOAK_FAIL(st, "16-byte pull is constant 0x%02X", a[0]);
		return false;
	}
	if (memcmp(a, b, sizeof a) == 0) {
		SOAK_FAIL(st, "two pulls identical");
		return false;
	}
	return true;
}

/* 0x90 TMU_COMPUTE -- CORDIC sqrt(4.0f) must come back 2.0f (the
 * answer is exact in binary32, so the 1e-3 tolerance only absorbs
 * CORDIC iteration error), plus sin(0) == 0. */
static bool t_tmu(soak_stat_t *st)
{
	float    in = 4.0f, out    = 0.0f;
	uint32_t in_bits, out_bits = 0;
	memcpy(&in_bits, &in, sizeof in_bits);
	alp_status_t s = gd32g553_tmu_compute(
	    &ctx, GD32G553_TMU_FN_SQRT, GD32G553_TMU_FMT_F32, in_bits, 0u, &out_bits);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "sqrt status=%d", (int)s);
		return false;
	}
	memcpy(&out, &out_bits, sizeof out);
	if (!float_near(out, 2.0f, 1e-3f)) {
		SOAK_FAIL(st, "sqrt(4.0) = %d/1000 (want 2000/1000)", (int)(out * 1000.0f));
		return false;
	}
	s = gd32g553_tmu_compute(&ctx, GD32G553_TMU_FN_SIN, GD32G553_TMU_FMT_F32, 0u, 0u, &out_bits);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "sin status=%d", (int)s);
		return false;
	}
	memcpy(&out, &out_bits, sizeof out);
	if (!float_near(out, 0.0f, 1e-3f)) {
		SOAK_FAIL(st, "sin(0) = %d/1000 (want 0)", (int)(out * 1000.0f));
		return false;
	}
	return true;
}

/* 0x27 TIMER_SYNC -- link TIMER0 (master) -> TIMER7 (slave, restart
 * mode) and immediately unlink (mode 0).  Runs AFTER the PWM tests in
 * the table: while linked, TIMER7's PWM4..7 phase-restart on TIMER0's
 * update -- harmless on unloaded bench pads, but keep the window
 * short and always restore the timers to independent free-run. */
static bool t_timer_sync(soak_stat_t *st)
{
	alp_status_t s = gd32g553_timer_sync(&ctx, 0u, 1u, 1u /* restart */);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "link status=%d", (int)s);
		return false;
	}
	s = gd32g553_timer_sync(&ctx, 0u, 1u, 0u /* disable */);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "unlink status=%d", (int)s);
		return false;
	}
	return true;
}

/* 0x28 POWER_MODE_SET -- mode 0 ("run") is the documented no-op
 * request: it exercises the full opcode path without putting either
 * SoC to sleep mid-soak.  The real sleep/wake transitions are their
 * own HIL rows (they tear down this very link). */
static bool t_power_mode(soak_stat_t *st)
{
	const alp_status_t s = gd32g553_power_mode_set(&ctx, 0u, 0u, 0u);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	return true;
}

/* 0x40 DA9292_STATUS_FORWARD -- on THIS SoM revision the DA9292
 * fault nets reach only the Renesas (P37/P36); the GD32 has no pin to
 * sample, so the contract says the reply is the 0xFF "no sample"
 * sentinel, always.  Anything else = firmware drifted from the wire
 * contract (or someone wired a new HW rev without updating it). */
static bool t_da9292_sentinel(soak_stat_t *st)
{
	uint8_t            v = 0;
	const alp_status_t s = gd32g553_da9292_status_forward(&ctx, &v);
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d", (int)s);
		return false;
	}
	if (v != 0xFFu) {
		SOAK_FAIL(st, "0x%02X (this HW rev must answer the 0xFF sentinel)", v);
		return false;
	}
	return true;
}

/* 0xF5 OTA_GET_STATE -- proves the 0xF0.. dispatch range routes
 * correctly without arming anything destructive.  Both deployments
 * pass: the UNARMED build answers NOSUPPORT for the whole OTA range;
 * the ARMED (partitioned) build answers a concrete, sane state
 * snapshot.  Anything else is a dispatch fault.  (The armed OTA
 * flow itself has its own dedicated bench procedure.) */
static bool t_ota_get_state(soak_stat_t *st)
{
	gd32g553_ota_state_info_t info;
	const alp_status_t        s = gd32g553_ota_get_state(&ctx, &info);
	if (s == ALP_ERR_NOSUPPORT) {
		return true; /* unarmed build: documented reply */
	}
	if (s != ALP_OK) {
		st->last_status = (int)s;
		SOAK_FAIL(st, "status=%d (want OK or NOSUPPORT)", (int)s);
		return false;
	}
	if (info.state > GD32G553_OTA_STATE_ERROR ||
	    (info.active_slot != GD32G553_OTA_SLOT_A && info.active_slot != GD32G553_OTA_SLOT_B)) {
		SOAK_FAIL(st,
		          "armed build, insane snapshot: state=%d active=%d",
		          (int)info.state,
		          (int)info.active_slot);
		return false;
	}
	return true;
}

