alplabai/alp-sdk/examples/v2n/v2n-gd32-bridge-hil-soak/src/main.c
/* ------------------------------------------------------------------ */
/* Test table -- cycle order matters: PWM readbacks run before        */
/* TIMER_SYNC briefly links their timers.                              */
/*                                                                    */
/* QUARANTINE HISTORY: entries marked quarantined are SKIPPED (printed */
/* once at boot).  No row is quarantined today -- every entry below    */
/* reads quarantined = false -- but six rows were, and the "why" is    */
/* worth keeping so a future regression doesn't re-diagnose it blind.  */
/*                                                                     */
/* The 2026-06-04 first-HiL pass quarantined SIX rows, all failing -5  */
/* (ALP_ERR_IO) from cycle 1: pwm_capture, adc_stream, qenc, tmu,      */
/* ota_get_state, trng.  That diagnosis PREDATED two compounding       */
/* host/transport bugs: a handler slower than the inter-transaction    */
/* gap missed its first reply read, and the slave's spent staging      */
/* cursor made every re-read fail PERMANENTLY (the transport_spi.c     */
/* rewind bug); on top of that the host masked every error reply's     */
/* true status behind the generic ALP_ERR_IO, so a real firmware fault */
/* and a transport replay miss looked identical on this table.  Fixed  */
/* the same day in 2e30b9d09 (rewind fix, short-ERROR-envelope decode, */
/* TRNG latched-fault handling): pwm_capture / qenc / tmu /            */
/* ota_get_state came back CLEAN -- their -5s were purely the          */
/* transport bug plus the missing decode, nothing in the HAL body.     */
/* trng also carried a REAL hardware condition underneath: the unit    */
/* takes intermittent seed errors and parks with the LATCHED fault     */
/* flags set (TRNG_STAT = 0x48 = ERRSTA + SEIF while current-status    */
/* SECS reads clear; SWD-captured).  Firmware now checks the latched   */
/* flags, fails the affected call fast (no reply-window overrun, no    */
/* cascade) and rebuilds on the next call -- the recovery is silicon-  */
/* validated (functional tier 26/26).  t_trng retries once to absorb a */
/* fault-recover cycle landing mid-test.                               */
/*                                                                     */
/* adc_stream was NOT a transport artefact -- it had its own real,     */
/* separate firmware defect, and its failure mode was genuinely        */
/* destructive: a failed STREAM_END left the 1 kHz circular DMA        */
/* running on DMA0 forever, contending with the SPI slave's CH2/CH3    */
/* until the whole link rotted, so it stayed quarantined through the   */
/* first fix pass rather than being re-tested blind.  Root cause       */
/* (found by a three-way audit against GigaDevice's vendor SPL         */
/* reference, fixed in ffdc66ee5): CTL1.DDM (the "request after last"  */
/* bit) was never set, so circular DMA stalled by design after one     */
/* run; DMA controls were programmed onto an already-enabled converter */
/* instead of the vendor's config-then-enable order; and the           */
/* RCU_DMAMUX clock was never explicitly enabled on the stream path    */
/* (masked at boot by the SPI transport enabling it first).            */
/*                                                                     */
/* Validation: 253/253 across a 20-row HIL soak on fw v0.2.8 + v0.2.9  */
/* (2026-06-06, docs/test-plan.md).  All six rows below now run        */
/* active every cycle.                                                 */
/* ------------------------------------------------------------------ */

typedef bool (*soak_fn_t)(soak_stat_t *st);

static struct {
	soak_stat_t stat;
	soak_fn_t   fn;
	bool        quarantined;
} tests[] = {
	{ { "ping", 0, 0, 0 }, t_ping, false },
	{ { "get_version", 0, 0, 0 }, t_get_version, false },
	{ { "get_build_id", 0, 0, 0 }, t_get_build_id, false },
	{ { "reset_reason", 0, 0, 0 }, t_reset_reason, false },
	{ { "gpio", 0, 0, 0 }, t_gpio, false },
	{ { "pwm_set_get", 0, 0, 0 }, t_pwm_set_get, false },
	{ { "pwm_single_pulse", 0, 0, 0 }, t_pwm_single_pulse, false },
	{ { "pwm_capture", 0, 0, 0 }, t_pwm_capture, false },
	{ { "adc_read", 0, 0, 0 }, t_adc_read, false },
	{ { "adc_stream", 0, 0, 0 }, t_adc_stream, false },
	{ { "adc_stream_guard", 0, 0, 0 }, t_adc_stream_guard, false },
	{ { "dac", 0, 0, 0 }, t_dac, false },
	{ { "qenc", 0, 0, 0 }, t_qenc, false },
	{ { "counter", 0, 0, 0 }, t_counter, false },
	{ { "trng", 0, 0, 0 }, t_trng, false },
	{ { "tmu", 0, 0, 0 }, t_tmu, false },
	{ { "timer_sync", 0, 0, 0 }, t_timer_sync, false },
	{ { "power_mode", 0, 0, 0 }, t_power_mode, false },
	{ { "da9292_sentinel", 0, 0, 0 }, t_da9292_sentinel, false },
	{ { "ota_get_state", 0, 0, 0 }, t_ota_get_state, false },
};

#define SOAK_TEST_COUNT (sizeof tests / sizeof tests[0])

/* ------------------------------------------------------------------ */
/* Link bring-up + recovery                                            */
/* ------------------------------------------------------------------ */

/* Same cold-boot-autonomous retry as the ping example: the CM33
 * system-manager starts before the GD32 finishes power-on (shared
 * PMIC reset-out), so init retries until the GD32 answers -- no fixed
 * boot delay anywhere. */
static void link_init_blocking(alp_spi_t *spi)
{
	unsigned     attempt = 0;
	alp_status_t s;
	do {
		s = gd32g553_init(&ctx, spi, NULL, GD32G553_BRIDGE_DEFAULT_I2C_ADDR);
		if (s != ALP_OK) {
			printf(
			    "[hil-soak] init attempt %u failed: %d -- retrying in 200 ms\n", attempt++, (int)s);
			k_msleep(200);
		}
	} while (s != ALP_OK);
	boot_version = ctx.version;
	printf("[hil-soak] link up after %u retr%s; firmware v%u.%u.%u\n",
	       attempt,
	       (attempt == 1u) ? "y" : "ies",
	       boot_version.major,
	       boot_version.minor,
	       boot_version.patch);
}

int main(void)
{
	printf("[hil-soak] V2N GD32 bridge full-command-set soak (25 MHz SPI)\n");

	/* 25 MHz SPI fast path -- the exact silicon-validated configuration
     * from v2n-gd32-bridge-ping (see that example's main.c for the full
     * clocking + DMA rationale).  i2c stays NULL: BRD_I2C has its own
     * HIL rows and must not stall this soak. */
	alp_spi_t *spi = alp_spi_open(&(alp_spi_config_t){
	    .bus_id        = 1u,
	    .freq_hz       = 25000000u,
	    .mode          = ALP_SPI_MODE_0,
	    .bits_per_word = 8u,
	    .cs_pin_id     = ALP_SPI_NO_CS, /* CS is owned by the platform SPI
                                         * driver on this SoM (P97 direct
                                         * latch) -- see v2n-gd32-bridge-ping */
	});
	if (spi == NULL) {
		printf("[hil-soak] alp_spi_open failed: err=%d -- cannot soak\n", (int)alp_last_error());
		return 1;
	}

	link_init_blocking(spi);

	/* Settle past the host's boot window before the heavy soak: during
     * A55 boot (U-Boot storage init, kernel driver probes + the ~T+15 s
     * clk/pinctrl sweeps) shared board state can disturb the link hard
     * enough to wedge an in-flight multi-opcode cycle (silicon-observed
     * 2026-06-04; the light PING-only probe rides it out, the full
     * command mix does not).  Steady-state operation -- the soak's
     * actual job -- is unaffected; autonomy is preserved because the
     * settle needs no interaction.  Bridging traffic during host boot
     * is tracked for the next-rev transport hardening. */
	printf("[hil-soak] link up -- settling 60 s past the host boot window\n");
	k_msleep(60000);
	link_init_blocking(spi); /* re-sync in case boot noise hit the link */

